{
  "_name_or_path": "./models/chat",
  "architectures": [
    "MistralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": 32000,
  "head_dim": 26,
  "hidden_act": "silu",
  "hidden_size": 312,
  "initializer_range": 0.02,
  "intermediate_size": 1092,
  "max_position_embeddings": 2048,
  "model_type": "mistral",
  "num_attention_heads": 12,
  "num_hidden_layers": 10,
  "num_key_value_heads": 4,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "sliding_window": 1024,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.44.0",
  "use_cache": true,
  "vocab_size": 32002
}
